In [2]:
import pandas as pd
df=pd.read_excel("D:\\Book1.xlsx",'Sheet1')
df1=pd.read_excel("D:\\Book1.xlsx",'Sheet2')
df2=pd.read_excel("D:\\Book1.xlsx",'Sheet3')
df

    Player Name  Age
0  Rahul Dravid   30
1   Virat Kohle   24
2  Vinod Kamble   22

In [4]:
df1

       Player Name  Salary (in lakhs)
0     Rahul Dravid                 45
1      Virat Kohle                 60
2  Harbhajan Singh                 44

In [6]:
df1.head(2).tail(1)

   Player Name  Salary (in lakhs)
1  Virat Kohle                 60

In [5]:
pd.merge(df,df1,on='Player Name')

    Player Name  Age  Salary (in lakhs)
0  Rahul Dravid   30                 45
1   Virat Kohle   24                 60

In [7]:
pd.merge(df,df1,on='Player Name',how='left')

    Player Name  Age  Salary (in lakhs)
0  Rahul Dravid   30               45.0
1   Virat Kohle   24               60.0
2  Vinod Kamble   22                NaN

In [10]:
pd.merge(df,df1,on='Player Name',how='right')

       Player Name   Age  Salary (in lakhs)
0     Rahul Dravid  30.0                 45
1      Virat Kohle  24.0                 60
2  Harbhajan Singh   NaN                 44

In [11]:
pd.merge(df,df1,on='Player Name',how='outer')

       Player Name   Age  Salary (in lakhs)
0     Rahul Dravid  30.0               45.0
1      Virat Kohle  24.0               60.0
2     Vinod Kamble  22.0                NaN
3  Harbhajan Singh   NaN               44.0

In [17]:
df2

  Sportsperson Name  Salary (in lakhs)
0      Rahul Dravid                 45
1       Virat Kohle                 60
2   Harbhajan Singh                 44

In [18]:
pd.merge(df1,df2,left_on='Player Name',right_on='Sportsperson Name',how='inner')

       Player Name  Salary (in lakhs)_x Sportsperson Name  Salary (in lakhs)_y
0     Rahul Dravid                   45      Rahul Dravid                   45
1      Virat Kohle                   60       Virat Kohle                   60
2  Harbhajan Singh                   44   Harbhajan Singh                   44